import math
import time
import datetime

# 1․ Գրել ֆունկցիա, որը․
#    - որպես արգումենտ կընդունի շրջանագծի շառավիղը (r) և սեկտորի անկյունը (alpha) ռադիաններով արտահայտված,
#    - կհաշվի և կտպի համապատասխան շառավղով և անկյունով շրջանի մակերեսը,
#    - բանաձևը՝ S = (pi * r ** 2) * alpha / 360, բանաձևի մեջ alpha-ն արտահայտված է աստիճաններով։

# def sector(r, alpha):
#     return (round(math.pi, 2) * r * 2) * alpha / 360
#
#
# print(sector(5, 90))

# 2․ Գրել ծրագիր, որը․
#    - կստանա 3 արգումենտ՝ տարի, ամիս, օր,
#    - կտպի թե նշված օրն շաբաթվա որ օրն է։




# 3․ Գրել ֆունկցիա, որը․
#    - կստանա արգումենտ արաբական բնական թիվ (0-ից մեծ),
#    - կվերադրձնի այդ թիվը հռոմեական տեսքով,
#    հռոմեական թվերի համարժեքները՝ I-1, V-5, X-10, L-50, C-100, D-500, M-1000,
#    օրինակ՝ 15 -> XV,
#            72 -> LXXII,
#            9 -> IX:

# dict_r = {1000: "M", 500: "D", 100: "C", 50: "L", 10: "X", 5: "V", 1: "I"}
#
#
# def rome(tiv):
#     list_rome = [tiv // 1000 * dict_r[1000], (tiv % 1000) // 500 * dict_r[500],
#                  ((tiv % 1000) % 500) // 100 * dict_r[100],
#                  (tiv % 1000 % 500 % 100) // 50 * dict_r[50], (tiv % 1000 % 500 % 100 % 50) // 10 * dict_r[10],
#                  (tiv % 1000 % 500 % 100 % 50 % 10) // 5 * dict_r[5],
#                  (tiv % 1000 % 500 % 100 % 50 % 10 % 5) // 1 * dict_r[1]]
#     return "".join(list_rome)
#
#
# print(rome(2225))
